Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0512GPG048.PIC
      <edc:DCRDef edc:_addr="0x1FC43FF0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BF1SEQ" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="BF1SEQ" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:BootConfigSector edc:beginaddr="0x1fc44000" edc:endaddr="0x1fc45000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1lastpage"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc45000" edc:endaddr="0x1fc4501c" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="adccal">
      <edc:DCRDef edc:_addr="0x1FC45000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4500C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC4" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC4" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC5" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC5" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVADC7" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVADC7" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ADCCALDATA" edc:desc="ADC Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="ADCCALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc45020" edc:endaddr="0x1fc45030" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="serial">
      <edc:DCRDef edc:_addr="0x1FC45020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
