Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0512GPG048.PIC
      <edc:SFRDef edc:_addr="0x1F80166C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="22" edc:access="---------------------------nnnnn" edc:cname="RPB11R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB11R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB11R" edc:desc="" edc:mask="0x1f" edc:name="RPB11R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801670" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="23" edc:access="---------------------------nnnnn" edc:cname="RPB12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB12R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB12R" edc:desc="" edc:mask="0x1f" edc:name="RPB12R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801674" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="24" edc:access="---------------------------nnnnn" edc:cname="RPB13R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB13R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB13R" edc:desc="" edc:mask="0x1f" edc:name="RPB13R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801678" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="25" edc:access="---------------------------nnnnn" edc:cname="RPB14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB14R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB14R" edc:desc="" edc:mask="0x1f" edc:name="RPB14R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80167C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="26" edc:access="---------------------------nnnnn" edc:cname="RPB15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB15R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB15R" edc:desc="" edc:mask="0x1f" edc:name="RPB15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801680" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="27" edc:access="---------------------------nnnnn" edc:cname="RPC0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC0R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC0R" edc:desc="" edc:mask="0x1f" edc:name="RPC0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801684" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="28" edc:access="---------------------------nnnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC1R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:desc="" edc:mask="0x1f" edc:name="RPC1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801688" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="29" edc:access="---------------------------nnnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC2R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:desc="" edc:mask="0x1f" edc:name="RPC2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80168C" edc:offset="0x04"/>
      <edc:SFRDef edc:_addr="0x1F801690" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="30" edc:access="---------------------------nnnnn" edc:cname="RPC4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC4R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC4R" edc:desc="" edc:mask="0x1f" edc:name="RPC4R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801694" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="31" edc:access="---------------------------nnnnn" edc:cname="RPC5R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC5R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC5R" edc:desc="" edc:mask="0x1f" edc:name="RPC5R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801698" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="32" edc:access="---------------------------nnnnn" edc:cname="RPC6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC6R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC6R" edc:desc="" edc:mask="0x1f" edc:name="RPC6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80169C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="33" edc:access="---------------------------nnnnn" edc:cname="RPC7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC7R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC7R" edc:desc="" edc:mask="0x1f" edc:name="RPC7R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8016A0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="34" edc:access="---------------------------nnnnn" edc:cname="RPC8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC8R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC8R" edc:desc="" edc:mask="0x1f" edc:name="RPC8R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8016A4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="35" edc:access="---------------------------nnnnn" edc:cname="RPC9R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC9R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC9R" edc:desc="" edc:mask="0x1f" edc:name="RPC9R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
