Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0512GPG048.PIC
      <edc:SFRDef edc:_addr="0x1F811050" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCRCXOR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DCRCXOR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCRCXOR" edc:desc="" edc:mask="0xffffffff" edc:name="DCRCXOR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811060" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn--------n-n-n--nnnnn-rnn" edc:cname="DCH0CON" edc:desc="" edc:impl="0xff00a9f7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx--------0-0-0--00000-000" edc:name="DCH0CON" edc:nzwidth="32" edc:por="xxxxxxxx--------0-0-0--00000-000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHPRI" edc:desc="" edc:mask="0x3" edc:name="CHPRI" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CHEDET" edc:desc="" edc:mask="0x1" edc:name="CHEDET" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CHAEN" edc:desc="" edc:mask="0x1" edc:name="CHAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHCHN" edc:desc="" edc:mask="0x1" edc:name="CHCHN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHAED" edc:desc="" edc:mask="0x1" edc:name="CHAED" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHCHNS" edc:desc="" edc:mask="0x1" edc:name="CHCHNS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CHPATLEN" edc:desc="" edc:mask="0x1" edc:name="CHPATLEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CHPIGNEN" edc:desc="" edc:mask="0x1" edc:name="CHPIGNEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY" edc:desc="" edc:mask="0x1" edc:name="CHBUSY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CHPIGN" edc:desc="" edc:mask="0xff" edc:name="CHPIGN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811070" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="--------nnnnnnnnnnnnnnnnnnnnn---" edc:cname="DCH0ECON" edc:desc="" edc:impl="0xfffff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------111111111111111100000---" edc:name="DCH0ECON" edc:nzwidth="32" edc:por="--------111111111111111100000---" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AIRQEN" edc:desc="" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIRQEN" edc:desc="" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PATEN" edc:desc="" edc:mask="0x1" edc:name="PATEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CABORT" edc:desc="" edc:mask="0x1" edc:name="CABORT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFORCE" edc:desc="" edc:mask="0x1" edc:name="CFORCE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHSIRQ" edc:desc="" edc:mask="0xff" edc:name="CHSIRQ" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="CHAIRQ" edc:desc="" edc:mask="0xff" edc:name="CHAIRQ" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811080" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="DCH0INT" edc:desc="" edc:impl="0xff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000--------00000000" edc:name="DCH0INT" edc:nzwidth="32" edc:por="--------00000000--------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHERIF" edc:desc="" edc:mask="0x1" edc:name="CHERIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHTAIF" edc:desc="" edc:mask="0x1" edc:name="CHTAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHCCIF" edc:desc="" edc:mask="0x1" edc:name="CHCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHBCIF" edc:desc="" edc:mask="0x1" edc:name="CHBCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHDHIF" edc:desc="" edc:mask="0x1" edc:name="CHDHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHDDIF" edc:desc="" edc:mask="0x1" edc:name="CHDDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHSHIF" edc:desc="" edc:mask="0x1" edc:name="CHSHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHSDIF" edc:desc="" edc:mask="0x1" edc:name="CHSDIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CHERIE" edc:desc="" edc:mask="0x1" edc:name="CHERIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHTAIE" edc:desc="" edc:mask="0x1" edc:name="CHTAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHCCIE" edc:desc="" edc:mask="0x1" edc:name="CHCCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHBCIE" edc:desc="" edc:mask="0x1" edc:name="CHBCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHDHIE" edc:desc="" edc:mask="0x1" edc:name="CHDHIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHDDIE" edc:desc="" edc:mask="0x1" edc:name="CHDDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHSHIE" edc:desc="" edc:mask="0x1" edc:name="CHSHIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHSDIE" edc:desc="" edc:mask="0x1" edc:name="CHSDIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
