Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0512GPG048.PIC
      <edc:SFRDef edc:_addr="0x1F860370" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------n---n-----------" edc:cname="CNCOND" edc:desc="" edc:grp="PORTD" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCOND" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE D" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860380" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="CNEND" edc:desc="" edc:grp="PORTD" edc:impl="0xffc0f17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="CNEND" edc:nzwidth="0x20" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIED1" edc:desc="" edc:mask="0x1" edc:name="CNIED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED2" edc:desc="" edc:mask="0x1" edc:name="CNIED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED3" edc:desc="" edc:mask="0x1" edc:name="CNIED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED4" edc:desc="" edc:mask="0x1" edc:name="CNIED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED5" edc:desc="" edc:mask="0x1" edc:name="CNIED5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED6" edc:desc="" edc:mask="0x1" edc:name="CNIED6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIED8" edc:desc="" edc:mask="0x1" edc:name="CNIED8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIED12" edc:desc="" edc:mask="0x1" edc:name="CNIED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED13" edc:desc="" edc:mask="0x1" edc:name="CNIED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED14" edc:desc="" edc:mask="0x1" edc:name="CNIED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED15" edc:desc="" edc:mask="0x1" edc:name="CNIED15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860390" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="CNSTATD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="CNSTATD" edc:nzwidth="0x20" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD1" edc:desc="" edc:mask="0x1" edc:name="CNSTATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD2" edc:desc="" edc:mask="0x1" edc:name="CNSTATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD3" edc:desc="" edc:mask="0x1" edc:name="CNSTATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD4" edc:desc="" edc:mask="0x1" edc:name="CNSTATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD5" edc:desc="" edc:mask="0x1" edc:name="CNSTATD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD6" edc:desc="" edc:mask="0x1" edc:name="CNSTATD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD8" edc:desc="" edc:mask="0x1" edc:name="CNSTATD8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD12" edc:desc="" edc:mask="0x1" edc:name="CNSTATD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD13" edc:desc="" edc:mask="0x1" edc:name="CNSTATD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD14" edc:desc="" edc:mask="0x1" edc:name="CNSTATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD15" edc:desc="" edc:mask="0x1" edc:name="CNSTATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="CNNED" edc:desc="" edc:impl="0xf17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="CNNED" edc:nzwidth="32" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNED1" edc:mask="0x1" edc:name="CNNED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED2" edc:mask="0x1" edc:name="CNNED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED3" edc:mask="0x1" edc:name="CNNED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED4" edc:mask="0x1" edc:name="CNNED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED5" edc:mask="0x1" edc:name="CNNED5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED6" edc:mask="0x1" edc:name="CNNED6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNED8" edc:mask="0x1" edc:name="CNNED8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNED12" edc:mask="0x1" edc:name="CNNED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED13" edc:mask="0x1" edc:name="CNNED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED14" edc:mask="0x1" edc:name="CNNED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED15" edc:mask="0x1" edc:name="CNNED15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="CNFD" edc:desc="" edc:impl="0xf17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="CNFD" edc:nzwidth="32" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFD1" edc:mask="0x1" edc:name="CNFD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD2" edc:mask="0x1" edc:name="CNFD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD3" edc:mask="0x1" edc:name="CNFD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD4" edc:mask="0x1" edc:name="CNFD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD5" edc:mask="0x1" edc:name="CNFD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD6" edc:mask="0x1" edc:name="CNFD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFD8" edc:mask="0x1" edc:name="CNFD8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFD12" edc:mask="0x1" edc:name="CNFD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD13" edc:mask="0x1" edc:name="CNFD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD14" edc:mask="0x1" edc:name="CNFD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD15" edc:mask="0x1" edc:name="CNFD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------------n-nnnnnn-" edc:cname="SRCON0D" edc:desc="" edc:impl="0x17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------0-000000-" edc:name="SRCON0D" edc:nzwidth="32" edc:por="-----------------------0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0D1" edc:mask="0x1" edc:name="SR0D1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D2" edc:mask="0x1" edc:name="SR0D2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D3" edc:mask="0x1" edc:name="SR0D3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D4" edc:mask="0x1" edc:name="SR0D4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D5" edc:mask="0x1" edc:name="SR0D5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D6" edc:mask="0x1" edc:name="SR0D6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0D8" edc:mask="0x1" edc:name="SR0D8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------------n-nnnnnn-" edc:cname="SRCON1D" edc:desc="" edc:impl="0x17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------0-000000-" edc:name="SRCON1D" edc:nzwidth="32" edc:por="-----------------------0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1D1" edc:mask="0x1" edc:name="SR1D1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D2" edc:mask="0x1" edc:name="SR1D2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D3" edc:mask="0x1" edc:name="SR1D3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D4" edc:mask="0x1" edc:name="SR1D4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D5" edc:mask="0x1" edc:name="SR1D5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D6" edc:mask="0x1" edc:name="SR1D6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1D8" edc:mask="0x1" edc:name="SR1D8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f88B000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:AdjustPoint edc:_addr="0x1F880000" edc:offset="0x7000"/>
      <edc:SFRDef edc:_addr="0x1F887000" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="nrnnnnnnnnnnnnnnn-nnnnn--nnnnnnn" edc:cname="ADCCON1" edc:desc="" edc:impl="0xffffbe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000110000000000-00000--0000uuu" edc:name="ADCCON1" edc:nzwidth="32" edc:por="00000110000000000-00000--0000xxx" edc:portals="CLR SET INV" ltx:baseofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMABL" edc:mask="0x7" edc:name="DMABL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:mask="0x1" edc:name="STRGLVL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:mask="0x7" edc:name="IRQVS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSPBCLKEN" edc:mask="0x1" edc:name="FSPBCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSSCLKEN" edc:mask="0x1" edc:name="FSSCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AICPMPEN" edc:mask="0x1" edc:name="AICPMPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:mask="0x1f" edc:name="STRGSRC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FRACT" edc:mask="0x1" edc:name="FRACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBSLV" edc:mask="0x7" edc:name="TRBSLV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBMST" edc:mask="0x7" edc:name="TRBMST" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBERR" edc:mask="0x1" edc:name="TRBERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBEN" edc:mask="0x1" edc:name="TRBEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC" edc:pos="14"/>
      </edc:SFRDef>
